zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_M4_COMMON.h
  CM4_LPE_BCTU_INT0_4_IRQn     = 222,              /**< ADC conversion triggered/ADC0 conversion data ready/ADC last command of list issued/FIFO1/FIFO2 */
  CM4_LPE_FTM_INT0_10_IRQn     = 223,              /**< Channel 0/Channel 1/Channel 2/Channel 3/Channel 4/Channel 5/Channel 6/Channel 7/Fault/Overflow/Reload */
  CM4_LPE_LCU_INT_IRQn         = 224,              /**< Logic Cell 0 */
  CM4_LPE_PIT_RTI_INT0_3_IRQn  = 225,              /**< Channel 0/Channel 1/Channel 2/Channel 3/Channel 4 (RTI) */
  CM4_LPE_RTC_API_INT0_1_IRQn  = 226,              /**< RTC compare and counter overflow/API compare */
  CM4_LPE_STM_INT0_3_IRQn      = 227,              /**< Channel 0/Channel 1/Channel 2/Channel 3 */
  CM4_LPE_FLEXCAN_INT0_8_IRQn  = 228,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  CM4_LPE_FLEXCAN_INT9_15_IRQn = 229,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  CM4_LPE_LPI2C_INT0_3_IRQn    = 230,              /**< Master/Asynchronous master/Slave/Asynchronous slave */
  CM4_LPE_LPSPI0_INT0_1_IRQn   = 231,              /**< Transmit and receive data and errors/Asynchronous */
  CM4_LPE_LPSPI1_INT0_1_IRQn   = 232,              /**< Transmit and receive data and errors/Asynchronous */
  CM4_LPE_LPUART0_INT0_3_IRQn  = 233,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  CM4_LPE_LPUART1_INT0_3_IRQn  = 234,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  CM4_LPE_LPUART2_INT0_3_IRQn  = 235,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  CM4_LPE_VFCCU_INT_IRQn       = 236,              /**< CM4 FCCU reaction 7 */
  CM4_CPE_XRDC_INT_IRQn        = 237               /**< Transfer Error */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M4 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M4 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */


/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* #if !defined(S32K566_M4_COMMON_H_) */

